run_cases/case05_singleGaussianWaveWithheatedFlow/0.orig/nonLinearZone/boundaryFile
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       IOobject;
    location    "0/nonLinearZone";
    object      boundaryFile;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

boundaryField
{
    interfaceL
    {
    	type			waveTransmissive;
    	value			uniform $lvalue;
    	gamma			1.4;
    	fieldInf		$lvalue;
    }
    interfaceR
    {
    	type			waveTransmissive;
    	value			uniform $rvalue;
    	gamma			1.4;
    	fieldInf		$rvalue;
    }
    "(top|bottom)"
    {
        type            empty;
    }
    "(front|back)"
    {
        type            empty;
    }
}

// ************************************************************************* //
