run_cases/case05_singleGaussianWaveWithheatedFlow/system/linearZone/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "system/linearZone";
    object          fvSchemes;
}

spatialScheme   DRP7;

filterScheme    SFo9p 0;

temporalScheme  LDDRK46;

interfaceInterpolation
{
}

ddtSchemes
{
    default         Euler;
}

divSchemes
{
    default         Gauss linear;
}

gradSchemes
{
    default         Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}


// ************************************************************************* //
