run_cases/case05_singleGaussianWaveWithheatedFlow/system/linearZone/spongeZonesDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      spongeZonesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

maxSigma	0.25;
maxOmega	0.00;

spongeZones
(
	{
		cellZone		spongeZoneR;
		direction		(1 0 0);
		sigmaMax		$maxSigma;
		omegaMax		$maxOmega;
	}
	
	{
		cellZone		spongeZoneL;
		direction		(-1 0 0);
		sigmaMax		$maxSigma;
		omegaMax        $maxOmega;
	}
);

// ************************************************************************* //
